---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeDeletedWarn
source: html/f4e07c4f-1222-0571-c276-9800bc57d61a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeDeletedWarn Property

Can't find new hosts for this Element.\nIt will be deleted on Finish Paste unless repositioned or rehosted.

## Syntax (C#)
```csharp
public static FailureDefinitionId FinalizedElementsWillBeDeletedWarn { get; }
```